package me.rockintuna.effectivejava.item;

/*
네이티브 메서드는 신중히 사용하라
 */
public class Item66 {
    // 네이티브 메서드는 신중히 사용하라
    // 자바는 C/C++에 비해 성능이 떨어지지만, 자바의 장점은 플랫폼 독립성이다.
    // 네이티브 메서드를 사용하면 플랫폼 독립성을 잃게 된다.
    // 또한, 네이티브 메서드는 자바의 예외 처리 모델��� 우회하기 때문에 예외 처리가 어렵다.
    // 따라서, 네이티브 메서드는 신중히 사용해야 한다.

    // 네이티브 메서드를 사용해야 하는 경우
    // 1. 성능이 중요한 경우
    // 2. 자바로 구현하기 어려운 경우
    // 3. 기존 C/C++ 라이브러리를 사용해야 하는 경우

    // 네이티브 메서드를 사용할 때 주의할 점
    // 1. 자바와 C/C++의 데이터 타입 차이를 이해��야 한다.
    // 2. 자바와 C/C++의 메모리 관리 차이를 이해해야 한다.
    // 3. 자바와 C/C++의 예외 처리 차이를 이해해야 한다.


}
